[
    {
        "source": {
            "id": null,
            "name": "Adweek"
        },
        "author": "Trishla Ostwal",
        "title": "Google Takes a Step Toward an Internet Built for AI Agents",
        "description": "The tech giant unleashes a new protocol called WebMCP, designed to help sites structure how AI agents interact with them.",
        "url": "https://www.adweek.com/media/google-takes-a-step-toward-an-internet-built-for-ai-agents/",
        "urlToImage": "https://static-www.adweek.com/wp-content/uploads/2025/05/google-ai-agent-chrome-2025.jpg?w=600&h=315&crop=1",
        "publishedAt": "2026-02-12T17:06:34Z",
        "content": "AI agents are moving beyond answering questions theyre starting to complete tasks like booking flights or making purchases. This week, Google unveiled WebMCP, a protocol designed to help websites kee… [+2837 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "AdExchanger"
        },
        "author": "AdExchanger Content Studio",
        "title": "Programmatic’s Next Era: Clarity Is The New Currency",
        "description": "Programmatic buying won the last decade because it made media cheaper to transact and easier to scale. That bet paid off. EMarketer projects programmatic will account for effectively all net-new display ad dollars in 2025, underscoring just how fully automati…",
        "url": "http://www.adexchanger.com/content-studio/programmatics-next-era-clarity-is-the-new-currency/",
        "urlToImage": "https://www.adexchanger.com/wp-content/uploads/2026/02/Illumin_Ostor_headshot.jpg",
        "publishedAt": "2026-02-12T13:00:00Z",
        "content": "Programmatic buying won the last decade because it made media cheaper to transact and easier to scale. That bet paid off. EMarketer projects programmatic will account for effectively all net-new disp… [+5235 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Digiday"
        },
        "author": "Seb Joseph",
        "title": "Future of Marketing Briefing: AI’s branding problem is why marketers keep it off the label",
        "description": "The reputational downside is clearer than the branding upside, which makes discretion the safer strategy.",
        "url": "http://digiday.com/marketing/future-of-marketing-briefing-ais-branding-problem-is-why-marketers-keep-it-off-the-label/",
        "urlToImage": "https://digiday.com/wp-content/uploads/sites/3/2025/10/ai-slop-digiday.jpg",
        "publishedAt": "2026-02-13T05:01:00Z",
        "content": "This Future of Marketing Briefing covers the latest in marketing for Digiday+ members and is distributed over email every Friday at 10 a.m. ET. More from the series →At this point in the Super Bowl a… [+12464 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Adweek"
        },
        "author": "PJ Bernacki",
        "title": "Submissions Open for ADWEEK Tech Stack Awards 2026",
        "description": "Entries for the 2026 ADWEEK Tech Stack Awards are now open. From products that enable advertisers to reach and capture audiences to martech platforms that transform how businesses operate, this […]",
        "url": "https://www.adweek.com/performance-marketing/submissions-open-for-adweek-tech-stack-awards-2026/",
        "urlToImage": "https://static-www.adweek.com/wp-content/uploads/2025/12/2025-TechStack-awards.png?w=600&h=315&crop=1",
        "publishedAt": "2026-02-12T09:05:33Z",
        "content": "Entries for the 2026 ADWEEK Tech Stack Awards are now open.\r\nFrom products that enable advertisers to reach and capture audiences to martech platforms that transform how businesses operate, this annu… [+6502 chars]"
    }
]