[
    {
        "source": {
            "id": null,
            "name": "Digiday"
        },
        "author": "Michael Bürgi",
        "title": "Canadian indie Salt XC expands its U.S. presence with purchase of Craft & Commerce",
        "description": "Less than a year after buying Nectar First, an AI-driven specialist, Salt XC has expanded its full-service media offerings with the purchase of Craft and Commerce.",
        "url": "http://digiday.com/media-buying/canadian-indie-salt-xc-expands-its-u-s-presence-with-purchase-of-craft-commerce/",
        "urlToImage": "https://digiday.com/wp-content/uploads/sites/3/2021/11/mergers-acquisitions-gif.gif",
        "publishedAt": "2026-02-11T05:01:00Z",
        "content": "There may be trade tensions between the U.S. and Canada thanks to on-again off-again tariff threats, but thats not stopping a Canadian-based independent shop from gaining a stronger foothold in the U… [+3696 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "AdExchanger"
        },
        "author": "Anthony Vargas",
        "title": "OOH Is Getting New Rules For Categorizing Venues In Programmatic Buys",
        "description": "Traditionally, digital out-of-home (OOH) inventory is grouped by venue type. But programmatic buyers want to know exactly what they’re bidding on – which is why generic categories like “retail” or “transit” just don’t cut it anymore. Not to mention that when …",
        "url": "http://www.adexchanger.com/programmatic/ooh-is-getting-new-rules-for-categorizing-venues-in-programmatic-buys/",
        "urlToImage": "https://www.adexchanger.com/wp-content/uploads/2026/02/ooh-dooh-outdoor-screens-ads-art-scaled-e1770684659913.jpg",
        "publishedAt": "2026-02-10T14:00:25Z",
        "content": "Traditionally, digital out-of-home (OOH) inventory is grouped by venue type.\r\nBut programmatic buyers want to know exactly what theyre bidding on  which is why generic categories like retail or trans… [+5044 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "AdExchanger"
        },
        "author": "David Hurwitz",
        "title": "Why Marketing Lost Its Long View – And How To Get It Back",
        "description": "Marketing has an uncomfortable habit we rarely acknowledge: We’re addicted to short-termism. For more than a decade, dashboards and last-click attribution have quietly dictated strategy. These tools were never built to explain how marketing drives growth; the…",
        "url": "http://www.adexchanger.com/content-studio/why-marketing-lost-its-long-view-and-how-to-get-it-back/",
        "urlToImage": "https://www.adexchanger.com/wp-content/uploads/2025/03/Mutinex_Innis_headshot.png",
        "publishedAt": "2026-02-10T13:00:54Z",
        "content": "Marketing has an uncomfortable habit we rarely acknowledge: Were addicted to short-termism.\r\nFor more than a decade, dashboards and last-click attribution have quietly dictated strategy. These tools … [+4571 chars]"
    }
]